// The boldface header in error boxes.

"Error" = "错误";

// Application name - alert box header

"Pacifist" = "Pacifist";

// Title of root package item

"Package Contents" = "软件包内容";
"Contents of Package %@" = "%@ 的内容";

// Default alert button

"OK" = "好";

// Alternate alert button

"Cancel" = "取消";

// Terminate the app in the case of an exception

"Terminate" = "终止";

// Refresh lists (such as the list of OS install packages)

"Refresh" = "刷新";

"Search" = "搜索";

// Default button in "Open" or "Cancel" alert box

"Open" = "打开";

// Default button in install alert box

"Install" = "安装";

"Don't Install" = "不安装";
"Upgrade" = "升级";
"Don't Upgrade" = "不升级";
"Remove" = "移除";
"Don't Remove" = "不移除";

"Extract" = "提取";

"Create" = "创建";

// Yes, no, and maybe

"Yes" = "是";
"No" = "否";
"Unknown" = "未知";

// Retry in case of error

"Try Again" = "重试";

// Continue Loading?

"Continue loading?" = "继续载入吗？";

// Check box to decide whether to use admin privileges

"Use Admin Privileges" = "使用管理员权限";

// Default button in overwrite box

"Overwrite" = "替换";

// check box used in replace dialog box

"DONT_ASK_AGAIN" = "不要再问";
"DONT_ASK_AGAIN_FOR_INSTALLATION" = "这次安装不要再询问";

// Alternate button in app bundle overwrite box

"Update" = "更新";

// Other button in app bundle overwrite box

"Leave Alone" = "保持原样";

// Cancel button in file overwrite box

"Stop Extraction" = "停止提取";
"Stop Installation" = "停止安装";
"Stop Loading" = "停止载入";
"Skip" = "跳过";

// Default button in app moved box

"EXISTING_LOCATION" = "替换现有安装";

// Alternate button in app moved box

"DEFAULT_LOCATION" = "安装在默认位置";

// abort and continue buttons in error box.

"Abort" = "停止";
"Continue" = "继续";

// Default button in fatal error box.

"Sorry" = "抱歉";

// Button titles

"OPEN_PACKAGE_BUTTON_TITLE" = "打开软件包";
"OPEN_PACKAGE_BUTTON_DESC" = "打开一个安装包，.zip，.tar，.cpio 或 .xar 归档，或磁盘映像";

"OPEN_URL_BUTTON_TITLE" = "打开 URL";
"OPEN_URL_BUTTON_DESC" = "从世界万维网远程打开软件包、归档或磁盘映像";

"OPEN_APPLE_INSTALLERS_BUTTON_TITLE" = "打开 Apple 安装器";
"OPEN_APPLE_INSTALLERS_BUTTON_DESC" = "打开任何插入的 Apple 安装盘，或 macOS 安装器应用程序";

"SEARCH_RECEIPTS_BUTTON_TITLE" = "搜索回执";
"SEARCH_RECEIPTS_BUTTON_DESC" = "搜索指定文件的所有安装器回执以检测什么软件安装了它，如果可能，重新安装";

"REGISTER_BUTTON_TITLE" = "立即注册…";

"CONTACT_BUTTON_TITLE" = "联系方式";

"SPLASH_SHORT_INSTRUCTIONS" = "拖动一个软件包、归档或磁盘映像文件到此窗口以打开它，或选择下面的选项：";

// drag-and-drop overlay message

"DND_OVERLAY_MESSAGE" = "请将安装包、归档或磁盘映像文件拖到这里。";

// VoiceOver labels

"GLOBE_ICON_VOICEOVER" = "全球";
"ENVELOPE_ICON_VOICEOVER" = "信封";

// Notification Center notifications (for Mountain Lion)

"NOTIFICATION_ARCHIVE_LOADED" = "归档已载入";
"NOTIFICATION_EXTRACT_FINISHED" = "提取结束";
"NOTIFICATION_EXTRACT_ITEM_COUNT %lu" = "%lu 项";
"NOTIFICATION_SU_FINISHED" = "软件更新包已载入";
"NOTIFICATION_RECEIPT_SEARCH_FINISHED" = "回执搜索结束";
"NOTIFICATION_RECEIPT_SEARCH_FOUND_ITEMS %lu" = "找到了 %lu 项";

// Extract To: dialog box

"OP_TITLE" = "提取到文件夹";
"OP_PROMPT" = "选取";

// For the Quick Start dialog box

"QUICK_START_TITLE" = "首次启动快速开始";
"ALWAYS_OPEN_WINDOW_ON_LAUNCH" = "启动 Pacifist 时始终显示此窗口";

// For the Licenses dialog box

"Licenses" = "许可证";

// For the Credits dialog box

"Credits" = "制作者";

// Create Receipt dialog box

"RECEIPT_OP_TITLE" = "创建回执";

// Tab titles in verification report window

"Summary" = "概要";
"Files Verified" = "文件已验证";
"Missing Files" = "丢失文件";
"Present Files" = "显示文件";
"Changed Files" = "更改的文件";
"Zero-Length Files" = "零字节文件";
"Incorrect Permissions" = "已更改权限";

// Verify save box

"VERIFY_TITLE" = "存储报告为：";

// Default filename for verification report

"VERIFY_DEFAULT_NAME" = "%@ 验证报告";

// File types

"Application" = "应用程序";
"Document" = "文稿";
"Folder" = "文件夹";
"Package" = "软件包";
"Symbolic Link" = "符号链接";
"Alias" = "替身";
"Socket" = "套接字";
"Character Special" = "特殊字符";
"Block Special" = "特殊区块";
"Remote Item" = "远程项目";

// The word "Version" for the splash screen

"Version" = "版本";
"Build" = "预释出软件：构建";

// Name for newly created folder for entire package contents

"NEW_FOLDER %@" = "%@ 文件夹";

// Inspector fields

"MULTIPLE_FILES" = "选择了多个文件";
"INSTALL_PATH" = "默认安装位置:\n%@";

// Prefix that goes before the default install path in the package window

"Package Install Directory: " = "软件包安装目录:";

// Prefix that goes in the authentication field in the package window if the package needs authentication

"Package requires authentication" = "软件包需要鉴定";

// Prefix that goes in the authentication field if the package doesn't need authentication

"Package does not require authentication" = "软件包不需要鉴定";

// Prefix that goes in the authentication field if the package is a receipt

"IS_RECEIPT" = "软件包是一个回执";

// Text that goes in the header if the package is signed

"IS_SIGNED %@ %@" = "软件包存在有效的签名 %@ (%@)";

// Text that goes in the header if the package is not signed

"IS_NOT_SIGNED" = "软件包没有签名";

// Text that goes in the header if the package's signature is invalid

"SIG_INVALID %@" = "签名无效：%@";

// Text that appears if a metapackage and its subpackages do not have the same signature

"SIG_MISMATCH" = "子软件包的签名不匹配";

// Prefix that goes in the root directory field if the package is a metapackage

"IS_METAPACKAGE" = "软件包是一个复合软件包";

// Prefix that goes in size field if packages is a receipt

"EMPTY_PACKAGE" = "软件包未包含可提取的文件";

// Prefix that goes before file sizes

"Size:" = "大小:";

// Units of file size

"bytes" = "字节";

// Prefix that goes before the compressed size field in the package window

"compressed" = "已压缩";

// Prefix that goes before the uncompressed size field in the package window

"uncompressed" = "未压缩";

// Ask whether to install a file

"Install File?" = "安装 “%@” 吗？";

// Ask whether to extract a file

"Extract File?" = "提取 “%@” 吗？";

// Ask whether to install entire package

"Install Package?" = "安装 “%@”的整个内容吗？";

// Ask whether to extract entire package

"Extract Package?" = "提取 “%@”的整个内容吗？";

// Ask whether to install selected files

"Install Selected Files?" = "安装所选文件吗？";

// Ask whether to extract selected files

"Extract Selected Files?" = "提取所选文件吗？";

// Explain where the file will be installed

"LOCATION_MESSAGE" = "文件将被安装到下列位置：\n%@";
"LOCATION_MESSAGE_MULT_FILES" = "文件将被安装到默认的安装位置。";
"LOCATION_MESSAGE_EXT" = "文件将被提取到下列位置：\n%@";
"LOCATION_MESSAGE_EXT_MULT_FILES" = "文件将被提取到下列位置：\n%@";
"BACKUP_SUGGESTION" = "推荐备份任何可能被替换的现有文件，以防安装出现错误。";

// Ask whether to generate receipts for a package (not used yet)

"RECEIPT_HEADER" = "创建回执吗？";
"RECEIPT_HEADER_MULT" = "创建回执吗?";

"RECEIPT_TEXT" = "回执将在下列位置创建：\n%@";

// Ask where to create a BOM file

"MAKE_BOM" = "创建 BOM 目录列表";
"MAKE_BOM_SIMPLIFIED" = "创建简洁的目录列表";
"MAKE_BOM_MESSAGE" = "请选取您想创建 BOM 目录列表的文件夹：";
"MAKE_BOM_PROGRESS" = "正在创建 BOM 目录列表. 请稍候…";
"MAKE_BOM_SAVEAS" = "存储 BOM 目录列表为：";

// Boldface confirmation message for overwriting something

"REPLACE_FILE_HEADER" = "文件已存在";

// Confirmation message before overwriting something
"REPLACE_FILE_TEXT %@" = "一个文件已存在于下列位置：\n%@\n\n您想替换它吗？";

// Boldface confirmation message for updating an app bundle

"UPDATE_APP_HEADER" = "应用程序已存在";

// Confirmation message before updating an app
"UPDATE_APP_TEXT %@" = "应用程序 “%@” 已经存在了。您想用这个软件包内的文件更新它吗？";

// Update or replace existing app bundle?
"Bundle already exists" = "应用程序已存在";
"BNDL_EXISTS %@" = "应用程序 %@ 已存在。您想用正在安装的捆绑直接替换现有的捆绑，还是更新现有的捆绑？\n\n如果您是重新安装程序，则应该点按 \"替换\"。如果您是安装更新，则应该点按 \"更新\" 以防止现有程序变成普通的文件夹。";

// Install moved bundle in new location? (not used yet)

"APP_MOVED_HEADER" = "应用程序已移动";
"APP_MOVED" = "应用程序捆绑 %1$@ 的一个之前的安装已在下列位置找到：\n\n%2$@\n\n您想用您安装的文件来更新此安装，还是安装文件到软件包的指定位置？";

// In the list of available disks, this follows the amount of free space. For example: "Macintosh HD (45 GiB ***free***)"

"DISK_LISTING_SIZE_SUFFIX" = "可用";

// Ask user to insert a disk

"INSERT_DISK_HEADER %@" = "请插入光盘 “%@”";
"INSERT_DISK_GENERIC %@" = "Pacifist 需要插入光盘 “%@” 才能继续。";
"INSERT_DISK_EXTRACTION %@ %@" = "Pacifist 需要插入光盘 “%1$@” 以便从软件包 “%2$@”提取文件。";
"INSERT_DISK_LOADING %@ %@" = "Pacifist 需要插入光盘 “%1$@” 以便结束载入软件包 “%2$@”。";

// header in "Extract To…" panel

"OPEN_PANEL_HEADER" = "请选取一个文件夹以便提取到其中：";

// header in Create Receipt panel

"CREATE_RECEIPT_HEADER" = "请为创建的回执选取一个文件夹：";

// header in Extract Packages panel

"EXTRACT_ARCHIVE_SP_HEADER" = "存储提取的归档为：";

// Generic "Please Wait" text

"GENERIC_PLEASE_WAIT" = "请稍侯…";

// Loading Package text

"LOADING_PACKAGE" = "正在载入归档内容。\n请稍候…";
"LOADING_PACKAGE %@" = "正在载入 %@。\n请稍候…";
"LOADING_MENU_ITEM" = "%@: 正在载入";

// Loading the "Open Apple Installers" window

"APPLE_PKGS_LOADING_MESSAGE" = "正在查找 Apple 安装包…";

// Extracting Item text

"EXTRACTING_ITEM" = "正在提取 %@。\n请稍候…";

// Downloading text

"Downloading %@..." = "正在下载 %@…";

// Extension Auditor progress

"LOADING_RECEIPTS" = "正在载入回执…";
"SEARCHING_RECEIPTS" = "正在搜索回执…";
"CHECKING_KEXTS" = "正在检查内核扩展…";

// Software Update package loading progress

"LOADING_SU_PKGS" = "正在载入软件更新包…";

// Extracting Files text

"Extracting Files..." = "正在提取文件…";

// Consolidating Files text

"CONSOLIDATING_FILES" = "正在合并文件…";

// Pruning unnecessary files

"REMOVING_UNNECESSARY_FILES" = "正在移除不需要的文件…";

// Joining Resource Forks text

"Joining Resource Forks..." = "正在添加 HFS 特定资源…";

// Setting File Permissions text

"Setting File Permissions..." = "正在设置文件权限…";

// Installing Files text

"Installing Files..." = "正在移动文件到位置…";

// Applying Patches text

"Applying Patches..." = "正在应用补丁…";

// Fixing Symbolic Links text

"Fixing Symbolic Links..." = "正在修复符号链接…";

// Verifying Files text

"Verifying Files..." = "正在验证文件…";
"VERIFY_REPORT_HEADER" = "软件包 %@ 的安装报告";
"VERIFY_DATE_SUFFIX" = " 在 %@\n\n";

// Preparing text

"PREPARING" = "正在准备…";

// Cleaning Up text

"CLEANING_UP" = "正在清理…";

// Data Fork

"Data Fork" = "数据分支";

// Install QuickLook Plug-In menu items

"QUICKLOOK_INSTALL_MENU_ITEM" = "安装快速查看插件…";
"QUICKLOOK_UPGRADE_MENU_ITEM" = "升级快速查看插件…";

// Prompt to install the QuickLook plugin

"QUICKLOOK_INSTALL_PROMPT" = "您想安装 Pacifist 快速查看插件吗？";
"QUICKLOOK_INSTALL_RECOVERY_SUGGESTION" = "如果您选择本次不安装插件，您可以稍后从 Pacifist 菜单手动选择安装快速查看插件来安装。";
"QUICKLOOK_UPGRADE_PROMPT" = "Pacifist 快速查看插件已过期。您想升级它吗？";
"QUICKLOOK_UPGRADE_RECOVERY_SUGGESTION" = "如果您选择本次不升级，您可以稍后从 Pacifist 菜单手动选择升级快速查看插件进行升级。";
"QUICKLOOK_ASK_ON_STARTUP" = "启动时始终检查快速查看插件";
"QUICKLOOK_INSTALL_CONFIRM" = "您确定要安装 Pacifist 快速查看插件吗？";
"QUICKLOOK_REMOVE_CONFIRM" = "您确定要移除 Pacifist 快速查看插件吗？";
"QUICKLOOK_DESCRIPTION" = "Pacifist 快速查看插件可让您从 Finder 选中可读取文件时按下空格键直接预览软件包和 .zip 文件。";

// verification report.

"VERIFY_REPORT_CONTENTS_BEGINNING" = "(跳到:";

"VERIFY_FILE_LIST" = "对下列文件和文件夹进行了验证：";
"VERIFY_MISSING_FILES" = "下列文件未在您的硬盘上找到。软件包可能没有完整安装，或文件可能已被删除。\n\n丢失的文件：";
"VERIFY_PRESENT_FILES" = "下列文件在您的硬盘上找到：";
"VERIFY_PERMS_CHANGED" = "下列文件的文件权限与软件包指定的权限不匹配。权限可能在文件安装后被更改。系统对一些文件定义不同的权限是正常的，因为一些文件可能被系统重新创建或修改。其它文件如果没有正确的权限，则可能无法正常运作。如果一个文件是由 Apple 软件安装，而您怀疑它的权限不正确，最简单的办法就是运行磁盘工具进行修复。\n\n更改了权限的文件：";
"VERIFY_CHANGED_FILES" = "下列文件的校验和与软件包指定的校验和不匹配。文件可能被更新到了较新的版本，或者它们被篡改了。\n\n更改的文件：";
"VERIFY_ZERO_LENGTH_FILES" = "下列文件有一个零字节文件，而非零大小指定在软件包内。这可能表明文件的损坏。";
"VERIFY_CKSUM_FAILED" = "下列文件无法检测，因为软件包未指定它们的校验和：";
"VERIFY_ALL_FILES_PRESENT" = "软件包内的所有文件都存在于硬盘。";
"VERIFY_NO_FILES_PRESENT" = "未从您硬盘的安装包中找到文件。软件包可能没有安装，或者文件已被删除。";
"VERIFY_ALL_PERMS_CORRECT" = "未在硬盘上找到权限与软件包内文件权限不同的文件。";
"VERIFY_NO_DIFFERENCES" = "未在硬盘上找到内容与软件包内文件内容不同的文件。";
"VERIFY_NO_ZERO_LENGTH_FILES" = "未在硬盘上找到软件包指定的非零字节文件大小的零字节文件。";
"VERIFY_SUMMARY" = "%lu 个文件被检测。\n\n";
"VERIFY_PRESENT_SUMMARY" = "%lu 个文件(共 %lu 个)存在于硬盘。\n\n";
"VERIFY_PERMS_SUMMARY" = "%lu 个文件(共 %lu 个)的文件权限与软件包指定的权限不匹配。\n\n";
"VERIFY_CKSUM_SUMMARY" = "%lu 个文件(共 %lu 个)的校验和与软件包指定的校验和不匹配。\n\n";
"VERIFY_ZERO_LENGTH_SUMMARY" = "%lu 个文件(共 %lu 个)有一个零字节文件，虽然非零大小指定在软件包内。\n\n";

// little advertisement in the verification report; first string is the app name (Pacifist), second is the version number in parentheses

"GENERATED_BY" = "由 %1$@ 生成 %2$@";

// various stuff related to permissions

"VERIFY_WRONG_OWNER" = "所有者是 %1$d，软件包指定 %2$d";
"VERIFY_WRONG_GROUP" = "组别是 %1$d，软件包指定 %2$d";
"VERIFY_WRONG_MODE" = "模式是 %1$o，软件包指定 %2$o";
// permissions errors

"SEPARATOR" = " - ";

// For generating and printing file lists

"CONTENTS_LIST_HEADER" = "文件 “%@” 的内容：\n\n";
"RESOURCES_LIST_HEADER" = "文件 “%@” 的资源：\n\n";

// this is for the Install to Disk… prompt

"DISK_PROMPT" = "请选取要安装到的磁盘：";

// stuff related to Apple install packages

"NO_APPLE_PKG_LION_HEADER" = "未在任何插入的光盘上找到已知的 Apple 安装包。";
"NO_APPLE_PKG_LION" = "请确保您有 Apple 安装 CD、DVD 或 USB 驱动器，并插入到电脑，或者 macOS 安装程序位于您的应用程序文件夹。如果您没有 macOS 安装程序的副本，您可以从 App Store 下载。";
"CHOOSE_APPLE_PKG" = "请选取要打开的 Apple 安装软件包：";

// Cancelling text

"Cancelling..." = "正在取消…";

// if the user tries to quit while extraction is going on:

"BUSY_HEADER" = "软件包正忙";

"SOMEONE_IS_BUSY" = "正在从一个或多个软件包提取文件。您确定要退出吗？";

// Status displayed in find panel when the find string is not found

"Not found" = "未找到";

// some required file in the .app bundle wouldn't load

"FILE_LOAD_ERROR" = "无法在应用程序捆绑中载入文件 “%@”。";

// couldn't add a file to a xar archive

"ARCHIVE_WRITE_ERROR" = "无法添加文件 “%@” 到归档。";

// couldn't find the specified file in an archive

"ARCHIVE_FIND_ERROR" = "无法在归档中找到文件 “%@”。";
"ARCHIVE_MULTIPLE_FIND_ERROR" = "无法在归档中找到指定文件。";

// couldn't open some random file

"COULDNT_OPEN_FILE" = "无法打开文件 %@。";

// some Software Update related errors

"SU_PKG_INCORRECT_TYPE" = "软件更新包 %@ 不是期望的类型。";
"SU_PKG_FORMAT_ERR" = "软件更新包 %@ 不是期望的格式。";

"CODESIGN_FAILED_BUNDLE" = "某个东西修改了 Pacifist 的应用程序捆绑。";
"CODESIGN_FAILED_CODE" = "某个东西修改了 Pacifist 的代码。";
"CODESIGN_FAILED_POSSIBLE_CAUSES" = "应用程序可能已损坏，否则可能被病毒感染了。";
"PROCEED_AT_OWN_RISK" = "请自己承担风险。";
"PLEASE_REINSTALL" = "请下载 Pacifist 未经更改的副本。";

// exceptions

"GENERIC_EXCEPTION" = "发生了下列例外：";
"ARCHIVE_LOAD_EXCEPTION %@" = "在尝试读取归档 “%@” 时发生了下列例外：";
"EXCEPTION_MORE_INFO_IN_CONSOLE" = "关于此错误的更多信息可以在控制台（在您的实用工具文件夹中）找到。在提交缺陷报告时请提供此信息。";

// Something went wrong with reading a file, not sure what

"GENERIC_FILE_ERROR" = "当试图读取文件 “%@” 时发生错误。";
"GENERIC_URL_ERROR" = "尝试读取 URL “%@” 时发生了一个错误。";

// Something tried to load a proxy early, before its disk was inserted

"DISK_NOT_FOUND" = "磁盘 “%@” 未找到。";

// Bom file wouldn't load (may be nonexistent, may be an incompatible format)

"BOM_ERROR" = "尝试打开软件包 “%@” 的 BOM 文件时发生错误。";
"DONT_RENAME_PACKAGE" = "请确保您没有重命名该软件包。";

// Disk image couldn't be mounted

"DISK_IMAGE_ERROR" = "当载入磁盘映像 “%@” 时发生错误。";
"DISK_IMAGE_MOUNT_ERROR" = "磁盘映像 “%@” 无法装上。";
"DMG_NOT_MOUNTED" = "磁盘映像 “%@” 未装载。";

// Download errors

"DOWNLOAD_ERROR" = "文件 “%1$@” 无法下载，因为发生了下列错误：\n\n%2$s";
"UNKNOWN_DOWNLOAD_ERROR" = "当下载文件 “%@” 时发生了未知错误。";
"NET_CONNECT_ERROR_GENERIC" = "Pacifist 访问网络时遇到了一个问题。请确保您的电脑已正常连接因特网。同样，请确保第三方防火墙软件没有阻断 Pacifist 访问网络。";
"NET_CONNECT_ERROR" = "Pacifist 无法连接到服务器 “%@”。请确保服务器名称正确，且您的电脑已正常连接到因特网。同时，请确保第三方防火墙没有阻止 Pacifist 访问网络。";

// Error that occurs when the package's bom file doesn't exist

"NO_BOM %@" = "软件包 “%@” 的 BOM 文件似乎不存在。";

"PACKAGE_DOESNT_EXIST" = "软件包 “%@” 似乎不存在。";

// Error that occurs when the necessary command-line tools aren't found at startup.

"Tools Missing" = "抱歉，下列的一个或多个命令行工具未找到：\n\n%@。\n\n要运行此程序需要这些工具。请检查它们是否在您的系统内。";
"MISSING_TOOLS" = "/usr/bin/lsbom 或 /bin/pax";

// Error that occurs when a folder to be installed already exists and it couldn't be replaced

"Error: Folder already exists." = "错误：文件夹已存在。";

// Error that occurs when a source file doesn't exist

"NO_SOURCE_FILE %@" = "文件 “%@” 不存在。";

// Error that occurs when a Zip file uses an unsupported compression type

"UNKNOWN_COMPRESSION_TYPE %@" = "文件 “%@” 使用了不支持的压缩方案进行压缩。";
"ZIP_VERSION_TOO_NEW" = "文件 “%@” 使用了比 Pacifist 支持的格式更新的 ZIP 格式进行压缩。";
"UNKNOWN_ZIP_EXTRA_INFO_SIG %x" = "未知额外信息签名 0x%x";
"UNKNOWN_ZIP_EXTRA_INFO_INFOZIP_VERSION %ld" = "未知版本的 Info-ZIP Unix 附加字段：%ld";

// Errors that can occur while parsing XAR archives

"XAR_ERR_NOT_A_XAR_FILE %@" = "文件 “%@” 不是 XAR 归档。";
"XAR_ERR_FILE_NOT_FOUND %@" = "指定的文件无法在 XAR 归档 “%@”中找到。";
"XAR_ERR_XATTR_NOT_FOUND %@" = "指定的扩展属性无法在 XAR 归档 “%@”中找到。";
"XAR_ERR_UNKNOWN_VERSION %@" = "文件 “%@” 似乎是不支持版本的 XAR 格式。";
"XAR_ERR_UNKNOWN_POSIX_FLAG %@" = "未知 POSIX 标志 “%@”.";
"XAR_ERR_UNSUPPORTED_FILE_TYPE" = "不支持的文件类型.";
"XAR_ERR_MISSING_FILE_ID %@ %@" = "在 XAR 归档 “%2$@”中丢失文件 ID %1$@ 。";
"XAR_ERR_MISSING_ELEMENT %@ %@" = "在 XAR 归档 “%2$@”中丢失 XML 元素 “%1$@” 。";
"XAR_ERR_MISSING_ATTR %@ %@ %@" = "在 XAR 归档 “%3$@”中丢失 XML 元素 “%2$@” 的属性 “%1$@”。";
"XAR_ERR_MISSING_CERT %@" = "在 XAR 归档 “%@”中丢失证书。";
"XAR_ERR_INVALID_VALUE %@ %@ %@" = "在 XAR 归档 “%3$@”中 XML 节点 “%2$@”的无效值 “%1$@”。";

// Error that occurs when a newly extracted file doesn't have the checksum that it should have

"BAD_CKSUM %@" = "文件 “%@” 的校验和不正确。";
"BAD_SIGNATURE %@" = "文件 “%@” 的签名不正确。";
"BAD_CERT %@"  = "文件 “%@” 的签名包含了无效的证书。";
"BAD_CKSUM_ADVICE" = "文件可能没有被成功提取或可能已损坏。";
"BAD_SIGNATURE_ADVICE" = "软件包可能已经损坏，或者可能被篡改了。";
"PLEASE_TAKE_CAUTION" = "请注意使用该文件。";
"UNSUPPORTED_CKSUM_ALG %@" = "不支持的校验和算法 “%@”。";
"UNSUPPORTED_CMP_ALG %@" = "不支持的压缩算法 “%@”。";
"UNSUPPORTED_SIG_TYPE %@" = "不支持的签名类型 “%@”";
"UNSUPPORTED_ALG_ADVICE" = "这可能说明是 Pcifist 还不支持的新版归档格式。请联系作者（support@charlessoft.com）并附上此错误消息的完整文本。";
"OPEN_ANYWAY" = "您仍然想要打开该软件包吗？";

// Patching errors

"PATCH_NO_SOURCE_FILE %@" = "该文件将打补丁：\n\n%@\n\n不存在。";
"PATCH_BAD_CKSUM %@" = "该文件将打补丁：\n\n%@\n\n没有必要的校验和。补丁无法应用。";

// Error that occurs when trying to replace a file with a folder

"NO_FOLDER_OVERWRITE_FILE" = "一个文件不能用一个文件夹替换。";

// Error that occurs when trying to replace a folder with a file

"NO_FILE_OVERWRITE_FOLDER" = "一个文件夹不能用一个文件替换。";

// Error when the default install folder happens to be a file instead of a folder.

"Destination path is a file, not a folder." = "目标路径是一个文件，不是文件夹。";

// Error if a folder can't be made for whatever reason

"CREATE_DIR_ERROR" = "无法创建目录 “%@”。";

// Error description if something was caused by Rootless mode

"CAUSED_BY_ROOTLESS" = "此错误似乎是因为您尝试写入受 macOS 系统完整性保护功能保护的目录而造成的。";

"ROOTLESS_DESC" = "​系统完整性保护是 macOS 为了保护特定系统文件不被修改（甚至是根用户也不允许）而增加的功能。此功能增强了系统的安全性，防止了不安全的安装程序和/或木马篡改系统。";

"ROOTLESS_DISABLE_INSTRUCTIONS" = "如果您有非常重要的理由必须忽略此安全功能而对系统进行改动，可以禁用系统完整性保护功能，方法是启动时按住 Command (⌘) 和 R 键，启动 Mac 到恢复模式，然后从实用工具菜单选择 “终端”，键入 “csrutil disable”，不要引号，然后按回车。在您作出更改之后，您应该重复此步骤，键入 “csrutil enable” 来重新启用系统完整性保护功能。";

// Other execute with privilege errors

"INSTALL_ERROR_WITH_DESC" = "试图安装文件 %1$@ 时发生错误：\n\n%2$@";
"PERM_MOVE_ERROR" = "无法移动文件 “%1$@”，因为文件夹 “%2$@” 不能修改。";
"TASK_BAD_STATUS %@ %d" = "任务 “%@” 以状态 %d 退出了。";

// Connection errors that can occur when talking to helper tool

"XPC_CONN_INTERRUPTED" = "到助手工具的连接已损坏。";
"XPC_CONN_INVALID" = "到助手工具的连接已无效。";
"XPC_CONN_UNEXPECTED" = "意外的助手工具连接。";
"XPC_CONN_UNEXPECTED_EVENT" = "意外的助手工具连接事件。";

// Something went wrong while trying to open a package

"CANT_OPEN_MYSELF" = "看起来您想用 Pacifist 打开它自身。";
"CANT_OPEN_MYSELF_INFORMATIVE" = "如果您想安装 Pacifist，只需要把它拖到您的应用程序文件夹即可。";
"CANT_OPEN_APP" = "抱歉，Pacifist 是用于打开软件包和归档文件，而非应用程序。请尝试打开一个软件包。标准软件包的文件名都有后缀 “.pkg”，且图标看起来像个棕色的纸箱。相反地，如果您想从 Apple 提供的安装光盘中重新安装一些文件，可以简单地将光盘插入，如果是多张光盘则确保它是第一张盘，然后在 Pacifist 的主窗口点按 “打开 Apple 安装盘” 按钮。";
"PKG_OPEN_ERROR" = "Pacifist 无法打开文件 “%@”。请确认这是 Pacifist 可解析的文件类型。";
"NOT_PKG_RECEIPT_SEARCH_HEADER" = "无法打开文件";
"NOT_PKG_RECEIPT_SEARCH_PROMPT" = "文件 “%@” 似乎不是可打开的软件包或归档。您想搜索安装器回执来尝试找出安装它的软件包吗？";
"NO_PKGS_IN_FOLDER" = "抱歉，在目录 “%@” 没有找到可读的软件包或归档文件。";

// The pax tool exited with an abnormal status

"PAX_ERROR" = "pax 工具因为异常状态退出: %d";

// Various AppleDouble errors

"Error format" = "Pacifist 在处理文件 %@ 时遇到了下列错误：\n\n%@";
"Bad version" = "无效的 applesingle/appledouble 附件 (版本损坏)。";
"Unknown Error %@" = "当处理文件 %@ 时遇到了未知错误。";
"Generic Error" = "发生了一个未知错误。";

// Out of space errors
"DISK_FULL" = "磁盘空间不足。";

// errors that can occur while parsing a distribution file

"DUPLICATE_XML_ELEMENT" = "软件包 “%@” 的分发文件中重复的 XML 元素：\n\n%@\n\n这可能说明了 Pacifist 中有缺陷。请发送报告到 support@charlessoft.com 并包括此错误的完整文本。";
"UNEXPECTED_XML_ELEMENT" = "软件包 “%@” 的分发文件中意外的 XML 元素：\n\n%@\n\n这可能说明了 Pacifist 中有缺陷。请发送报告到 support@charlessoft.com 并包括此错误的完整文本。";
"MISSING_PKG_REF" = "软件包 “%@” 的分发文件中软件包援引丢失：%@";
"MISSING_CHOICE" = "软件包 “%@” 的分发文件中选择项丢失：%@";
"MISSING_CHOICES_OUTLINE" = "软件包 “%@” 的分发文件中选择项大纲丢失";

// This message occurs when you open an OS install package for a version of macOS other than the version that is currently running

"OS_VERSION_MISMATCH %@ %@ %@" = "软件包 “%@” 的设计目的是安装到 macOS 版本 %@，而您目前运行的是 macOS 版本 %@。";
"OS_VERSION_MISMATCH_EXPLANATION" = "从此软件包提取的应用程序和其它文件可能无法在您的 macOS 版本上正常工作。";
"OS_VERSION_MISMATCH_REFUSAL %@" = "请为 macOS 版本 %@ 选择一个安装器。";
"OS_VERSION_MISMATCH_SUGGESTION_LION %@" = "您如果打开包含 macOS 版本 %@ 的安装光盘或从 App Store 下载的安装器，可能会有更好的结果。";

// Strings related to reinstalling a file from the Receipt Search window

"SU_PKG_NOT_FOUND_BY_NAME" = "无法找到名为 “%@” 的软件更新包。";
"SU_PKG_NOT_FOUND_BY_ID" = "无法找到与软件包标识符 “%@” 一致的软件更新包。";
"SU_PKG_NOT_FOUND_SUGGESTION" = "您可以跳过载入此软件包，搜索此软件包的所有光盘，或者手动定位。";
"SU_PKG_SKIP_WARNING" = "跳过安装包可能导致该项恢复不完整。";
"SU_PKG_NOT_FOUND_OPTION_SEARCH" = "搜索所有光盘";
"SU_PKG_NOT_FOUND_OPTION_LOCATE" = "手动定位…";
"SU_PKG_NOT_FOUND_SEARCH_PROGRESS" = "正在搜索 “%@”…";
"SU_PKG_NOT_FOUND_SEARCH_UNSUCCESSFUL" = "抱歉，软件包 “%@” 未在任何插入的光盘中找到。";
"SU_PKG_NOT_FOUND_OP_PROMPT" = "请定位软件包 “%@”：";
"SU_PKG_OP_MISMATCH" = "抱歉，指定的软件包与软件包 “%@” 不同。";
"REINSTALL_PKG_LIST" = "文件将从下列软件包提取：";
"REINSTALL_NOT_FOUND" = "下列软件包无法找到：";
"NO_RECEIPTS_FOUND_FOR_SEARCH" = "未找到符合搜索词的回执";
"NO_PACKAGES_FOUND_FOR_EXTRACTION" = "提取不能继续，因为未找到可用的软件包进行提取。";
"CHECKING_PACKAGES" = "正在检查软件包…";
"ITEM_NOT_FOUND_IN_RECEIPTS" = "下列文件未在任何软件包中找到：";
"ITEMS_NOT_FOUND_IN_RECEIPTS" = "下列文件未在任何软件包中找到：";
"ITEMS_NOT_FOUND_IN_RECEIPTS_PROMPT" = "这些可能只是在更新中被移除的过期文件，或者它们是丢失的文件，可能导致提取不完整。\n\n您仍然想尝试提取文件吗？";
"COULDNT_LOAD_INSTALL_HISTORY" = "无法载入安装历史。";

// Button title to go to the App Store download page for macOS

"DOWNLOAD_OS_X %@" = "下载 macOS %@ 安装器";

// This message lets you know about the lame option-click thing you have to do if you've already bought Lion

"DOWNLOAD_OS_X_INSTRUCTIONS %@ %@" = "您现在将被重定向到 Mac App Store 中 macOS %@ 的预览页面，那里包含 macOS %@ 在 App Store 的下载链接。";
"DOWNLOAD_OS_X_ADVICE %@ %@" = "如果 App Store 提示 macOS %@ 已经安装且不提供下载链接，可以按住 Option 键再点按 App Store 的 “已购买” 按钮。这可以启用 macOS %@ 安装器的 “安装” 按钮。";
"DOWNLOAD_OS_X_DONT_INSTALL" = "重要通知：App Store 在下载结束后会自动启动 macOS 安装器。如果发生这种情况，请不要重新安装 macOS 并退出安装器。没有必要重新安装 macOS 来让 Pacifist 打开安装器，只需要让其留在硬盘上。";

// This message occurs when you try to go to the download page for a version of macOS that Pacifist doesn't know about

"DOWNLOAD_OS_X_UNKNOWN_URL" = "抱歉，Pacifist 当前没有 URL 来下载 macOS 版本 %@。";

// This message occurs when you try to use a feature on an unsupported version of macOS

"OLD_OS_HEADER" = "不支持的操作系统版本";
"OLD_OS_FEATURE" = "抱歉，该功能需要 macOS  %@ 或更高版本。";

// Expired

"Expired" = "已过期";

// Expiration message for beta versions

"Expiration message" = "抱歉，这个测试版的 Pacifist 已经过期了。现在应该已经有新版本可用，可能有更多功能并修复了一些错误。您可以到这里下载新的版本：http://www.charlessoft.com。";

// Registration stuff

"UNREGISTERED" = "未注册";
"REGISTERED_TO" = "注册给：";
"REG_VERIFIED" = "注册成功";
"REG_SUCCESS" = "感谢您支持共享软件！";
"BAD_REG_CODE" = "抱歉，该注册码无效。";
"TRY_AGAIN" = "请再试一次。";

// A question mark

"?" = "？";

// A comma

"COMMA" = "，";
